Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_PlaygroundBookFormatRef/PlaygroundBookFormatReference-level2.tmx
Source language: en_us
Languages: ja

source: This protocol provides liveViewSafeAreaGuide, a UILayoutGuide property set to the safe area.
ja: このプロトコルはliveViewSafeAreaGuide、安全領域へ設定されるUILayoutGuideプロパティを提供します。

source: This table describes the changes to Playground Book Format Reference.
ja: この表は、プレイグラウンドブックフォーマットリファレンスに対する変更を記述します。

source: This, in turn, gives threads and callbacks time to execute.
ja: これは、順番に、スレッドとコールバックに実行に十分な時間を与えます。

source: Thumbnail images should be 902px × 678px.
ja: サムネイル画像は、902px × 678pxでなければなりません。

source: Title Key
ja: Titleキー

source: To access the property, conform your UIViewController or UIView class to the protocol.
ja: このプロパティにアクセスするには、あなたのUIViewControllerまたはUIViewクラスをこのプロトコルに準拠させてください。

source: To add a link to your feed, you'll need two pieces of information:
ja: あなたのフィードにリンクを追加するには、あなたは２つの情報断片を必要とします：

source: To cancel a connection attempt, call the disconnect(from:) method.
ja: ある接続の試みをキャンセルするには、disconnect(from:)メソッドを呼び出してください。

source: To create an editable string, place the quotation marks (") immediately inside the delimiters, as shown below.
ja: 編集可能文字列を作成するには、クォーテーション記号（"）を区切り記号の直ぐ内側においてください、下で示すように。

source: To enable this, a playground page must have a Prose.strings file in each localization folder in the PrivateResources folder.
ja: これを可能にするために、プレイグラウンドページはProse.stringsファイルをPrivateResourcesの中の各ローカライズフォルダに持たなければなりません。

source: To enable this, the playground page Manifest.plist file must specify certain information for the CodeCopySetup key, including the text displayed to the user in the playground page.
ja: これを可能にするために、プレイグラウンドページManifest.plistファイルは、一定の情報をCodeCopySetupキーに対して指定して、プレイグラウンドページにおいてユーザに表示されるテキストを含んでいなければなりません。

source: To localize a cutscene, enclose the cutscene files in a localization folder, such as en.lproj for English, within the PrivateResources folder.
ja: カットシーンをローカライズするために、カットシーンファイルをローカライズフォルダの中に、例えば英語に対してはen.lprojの中に同封することを、PrivateResourcesフォルダの内部で行ってください。

source: To localize the glossary, enclose the glossary property list file in a localization folder, such as en.lproj for English, within the PrivateResources folder.
ja: グロッサリーをローカライズするために、グロッサリープロパティリストをローカライズフォルダの中に、例えば英語に対してはen.lprojの中に同封することを、PrivateResourcesフォルダの内部で行ってください。

source: To open a live view, set PlaygroundPage.current.liveView to an instance of a class that inherits from UIViewController or UIView.
ja: あるライブビューを開くには、PlaygroundPage.current.liveViewをUIViewControllerまたはUIViewから継承するクラスのインスタンスに設定してください。

source: To provide just a solution, leave the hints array empty.
ja: ただ解答だけを提供するには、hints配列を空のままにしてください。

source: To stop execution at any time, use finishExecution().
ja: いつでも実行を停止するには、 finishExecution()を使ってください。

source: To use the PlaygroundBluetooth framework in a playground, import the module using the following statement:
ja: PlaygroundBluetoothフレームワークをプレイグラウンドの中で使用するには、そのモジュールを以下の文を使ってインポートしてください：

source: To use the PlaygroundBluetooth framework while writing playground books in Xcode, download the Swift Playgrounds Author Template from Downloads for Apple Developers.
ja: プレイグラウンドブックをXcodeで書いている間にPlaygroundBluetoothフレームワークを使うには、Swift Playgrounds Author TemplateをDownloads for Apple Developersからダウンロードしてください。

source: To use the PlaygroundSupport module while writing playground books in Xcode, download the Swift Playgrounds Author Template from Downloads for Apple Developers.
ja: プレイグラウンドブックをXcodeで書いている間にPlaygroundSupportモジュールを使うには、Swift Playgrounds Author TemplateをDownloads for Apple Developersからダウンロードしてください。

source: To use this module in a playground, import the module using the following statement:
ja: このモジュールをプレイグラウンドで使うには、モジュールを以下の文を使ってインポートしてください。

source: Token placeholders can include an optional type.
ja: トークンプレースホルダーは、任意の型を含むことが出来ます。

source: Touching the spoiler button displays the hint.
ja: スポイラーボタンにタッチするとヒントが表示されます。

source: Transfer the updated book into Swift Playgrounds using iCloud or AirDrop
ja: 更新されたブックをSwift PlaygroundsへiCloudまたはAirDropを使って転送する

source: Turning off logging can speed up execution of playgrounds.
ja: ログをオフに切り替えることで、プレイグラウンドの実行をスピードアップできます。

source: Type
ja: 型

source: Understanding Feeds and JSON
ja: フィードとJSONを理解する

source: Understanding Subscriptions
ja: サブスクリプションを理解する

source: Update a Subscription by Adding Items to Its Feed
ja: サブスクリプションをそれのフィードに項目を追加して更新する

source: Updating list of available frameworks for iOS 11.
ja: iOS 11で利用可能なフレームワークのリストを更新した。

source: Uploading files usually involves a web host, which is a service provider that specializes in making data available online.
ja: アップロードするファイルは、通常ウェブホストを必要とします、それはデータをオンラインで利用可能にすることを専門とするサービスプロバイダです。

source: Upon discovering a peripheral, the central manager calls the delegate’s centralManager(_:didDiscover:withAdvertisementData:rssi:) method.
ja: 周辺機器の発見の場合に、セントラルマネージャはデリゲートの持つcentralManager(_:didDiscover:withAdvertisementData:rssi:)メソッドを呼び出します。

source: Use PosterReference Key to show a small image such as a logo, or a large image that works for multiple screen sizes because the live view area can be resized.
ja: PosterReference Keyを使って、ロゴなどの小さな画像を、または複数の画面サイズで機能する大きな画像を表示してください、なぜならライブビューエリアはリサイズされることができるからです。

source: Use current to find the playground page instance.
ja: currentを使ってプレイグラウンドページインスタンスを見つけてください。

source: Use a forward slash followed by an asterisk and then a colon (/*:) for the opening comment delimiter.
ja: １つのスラッシュに続けてアスタリスクとそれからコロン（/*:）を開きコメント区切り記号に使ってください。

source: Use a glossary link when you introduce a new term and when you need to refer to a term that was defined earlier.
ja: グロッサリーリンクをあなたが新しい用語を導入する時にそしてあなたが以前に定義された用語を参照する必要がある時に使ってください。

source: Use an asterisk followed by a forward slash (*/) for the closing comment delimiter.
ja: １つのアスタリスクに続けてスラッシュ（*/）を閉じコメント区切り記号に使ってください。

source: Use an issue icon to indicate problems such as outdated firmware or a lost connection.
ja: 問題点アイコンを使って旧式のファームウェアや接続の喪失といった問題を指し示してください。

source: Use built-in or custom filters to process still and video images in near real-time.
ja: 組み込みまたはカスタムのフィルタを使ってスチール及びビデオイメージをほとんど実時間で処理します。

source: Use event handling, drawing, windows, views, and controls designed specifically for the Multi-Touch interface.
ja: Multi-Touchインターフェイスのために特別に設計されたイベント処理、描画、ウインドウ、ビュー、そしてコントロールを使います。

source: Use math libraries, background texture loading, pre-created shader effects, and a standard view and view controller to implement your rendering loop.
ja: 数学ライブラリ、パックグラウンドテクスチャロード、あらかじめ作成されたシェーダーエフェクト、そして標準ビューとビューコントローラを使って、あなたのレンダリングループを実装します。

source: Use specialized data types to interact with audio streams, complex buffers, and audiovisual timestamps.
ja: 特殊化されたデータ型を使って、オーディオストリーム、複合バッファ、そしてオーディオビジュアルタイムスタンプと相互作用します。

source: Use the description namespace when you need to select specific symbols from a set of overloaded symbols that share a common name but have different parameter types.
ja: description名前空間を、あなたが特定のシンボルを一揃いのオーバーロードされたシンボルで一般的なある名前を共有するが異なるパラメータ型を持つものから選択する必要がある場合に使ってください。

source: Use the provided template to create HTTP requests.
ja: 提供されるテンプレートを使ってHTTPリクエストを作成します。

source: Use this key to customize the display of terminology in a localized glossary.
ja: このキーを使って、ローカライズされたグロットリーにおける用語の表示をカスタマイズしてください。

source: Use this module to:
ja: このモジュールを使うことで：

source: Use this protocol to receive messages from a remote proxy and to be informed when the connection with the remote proxy is closed.
ja: このプロトコルを使ってリモートプロキシからメッセージを受け取って、リモートプロキシとの接続が閉じられるならば通知されるようにしてください。

source: Use two forward slash characters followed by a colon (//:) for a single line of markup for a playground.
ja: ２つのスラッシュ文字に続くコロン（//:）を単一行のマークアップとしてプレイグラウンドに使ってください。

source: Use uniform type identifier (UTI) information to create and manipulate data that can be exchanged with other apps and services.
ja: ユニホーム型識別子（UTI）情報を使って、他のアプリおよびサービスと交換されることができるデータを作成および操作します。

source: Used to control the display of the live view area while the live view is not running.
ja: ライブビューが動作していない間ずっとライブビューエリアの表示を制御しています。

source: User-viewable name for the book
ja: ユーザに見られるブックの名前

source: User-viewable name for the chapter
ja: その章のためのユーザに見られる名前

source: User-viewable name for the cutscene
ja: ユーザに見られるカットシーンの名前

source: User-viewable name for the page
ja: ユーザに見られるページの名前

source: Users can access your glossary in two ways:
ja: ユーザは、あなたのグロッサリーに２つの方法でアクセスできます：

source: Valid keywords: for, func, if, let, var, and while.
ja: 有効なキーワード：for, func, if, let, var, そして while。

source: Valid literal types: array, boolean, color, dictionary, image, integer, nil, string, and tuple.
ja: 有効なリテラル型：array, boolean, color, dictionary, image, integer, nil, string, そして tuple。

source: Version Key
ja: Versionキー

source: View controllers are preferred.
ja: ビューコントローラが推奨されます。

source: When liveView is set to a non-nil value, the system sets needsIndefiniteExecution to true.
ja: liveViewが非nil値に設定される間、システムはneedsIndefiniteExecutionをtrueに設定します。

source: When it is set to true, the safe area can be smaller than the live view area shown in the following screenshot.
ja: それがtrueに設定される場合、安全領域は以下のスクリーンショットで示されるライブビュー領域より小さい可能性があります。

source: When page content references a resource by name, it consults the PublicResources and PrivateResources folders at the page, chapter, and book levels, resolving in the following ways:
ja: ページ内容があるリソースを名前によって参照する場合、それはページ、章、そしてブックレベルでのPublicResourcesとPrivateResourcesフォルダに相談して、以下の方法で解決します：

source: When run on a device set to an English-speaking locale, the playground page automatically replaces the localization delimiter with the text.
ja: 英語を話すロケールに設定されたデバイス上で実行される場合、プレイグラウンドページは自動的にローカライズ区切り記号をテキストと置き換えます。

source: When this key is set to false, the safe area is the live view area.
ja: このキーがfalseに設定される場合、安全領域はそのライブビューエリアです。

source: When working with asynchronous code, enable indefinite execution to allow execution to continue after the end of the playground’s top-level code is reached.
ja: 非同期コードを扱う場合、無期限の実行を可能にすることで、プレイグラウンドのトップレベルコードの終わりに届いた後に、実行が継続できるようにしてください。

source: When writing the JSON for a feed, it can be helpful to compare the structure of your feed’s files with the structure of the URLs in the feed.
ja: フィードのためのJSONを書いている時、それはあなたのフィードの持つファイルの構造をフィードの中のURLの構造と比較する助けとなりえます。

source: When you hear something is a subscription, you expect it to be updated over time.
ja: ある物がサブスクリプション（定期購読、配信）であるとあなたが聞きおよぶ時、あなたはそれがやがて更新されることを予想します。

source: When you update a playground book, be sure to update the JSON feed that links to the book at the same time.
ja: あなたがプレイグラウンドブックを更新する時、そのブックにリンクするJSONフィードを同時に更新することを確実にしてください。

source: With the PlaygroundSupport module, you can leverage supporting functionality in Swift Playgrounds to interact with playground pages and live views.
ja: PlaygroundSupportモジュールを使って、あなたはSwift Playgroundsにおいてサポートしている機能性を活用して、プレイグラウンドページおよびライブビューと相互作用することが可能です。

source: With the playground book package format, you can create a document that includes features such as playground pages, live views containing iOS views, and animated cutscenes.
ja: playgroundブックパッケージ形式で、あなたは様々な機能、例えばplaygroundページ、iOSビューを入れたライブビュー、そしてアニメーションカットシーンなどを含む文書を作成できます。

source: Work with image and video assets managed by the Photos app, including those from iCloud Photo Library and Live Photos.
ja: Photosアプリによって管理されるイメージおよびビデオアセットを扱います、iCloud Photo LibraryとLive Photosを含みます。

source: You can add placeholder tokens to the editable areas in your playground that the user selects as a single element, including any spaces in the name.
ja: あなたは、プレースホルダートークンをあなたのプレイグラウンドの編集エリアに加えることが出来ます、それはユーザが単一の要素として、その名前の中のあらゆる空白を含めて選択できます。

source: You can add inline or multiline fields for users to enter code for a playground.
ja: あなたは、複数行またはインラインのフィールドをユーザがコードをプレイグラウンドに入力するよう追加できます。

source: You can add prose to be displayed on a page by using comment markers in .swift files.
ja: あなたは、散文を加えてページで表示されるようにすることが.swiftファイルの中のコメントマーカーを使って行えます。

source: You can change the completions shown while editing any part of the playground page.
ja: あなたは、プレイグラウンドページの何らかの部分を編集する間に表示される補完を変更することが出来ます。

source: You can customize the code completions shown in the shortcut bar by hiding and showing different symbols or sets of symbols.
ja: あなたは、ショートカットバーにおいて表示されるコード補完をカスタマイズすることが、異なるシンボルまたはひとそろいのシンボルを隠したり表示したりすることによって行えます。

source: You can dynamically update the hints for a page using the fail case of the AssessmentStatus Enumeration.
ja: あなたは、あるページのヒントを動的に更新することがAssessmentStatus列挙のfailケース節を使って行えます。

source: You can enable users to copy code specified in editable code areas from one playground page to another.
ja: あなたは、編集コードの中で指定されるコードをあるプレイグラウンドページから別のものへとユーザにコピーさせるように出来ます。

source: You can hide code that is not related to the main content of a playground page, such as calls to page setup functions, code for assessing the progress of the learner, and functions used in editable examples.
ja: あなたは、プレイグラウンドページのメインコンテンツに関係しないコード、例えばページ設定関数への呼び出し、学習者のはかどり具合を評価するためのコード、そして編集可能な例で使われる関数などを隠すことが出来ます。

source: You can localize hints by enclosing the hints property list file in a localization folder within the PrivateResources folder.
ja: あなたは、ヒントプロパティリストファイルをPrivateResourcesフォルダ内のローカライズフォルダの中に納めることによってヒントをローカライズできます。

source: You can localize the content displayed in comment markers by using the localized delimiter.
ja: あなたは、コメントマーカーの中に表示される内容をlocalized区切り記号を使うことでローカライズできます。

source: You can place hidden code at the top and bottom of a playground page.
ja: あなたは、非表示コードをプレイグラウンドページの最上部と最下部に置くことが出来ます。

source: You can provide localizations of your subscription content by first linking to a supplemental JSON object that maps locale IDs to locale-specific feeds.
ja: あなたは、あなたのサブスクリプション内容の現地語化を追加JSONオブジェクトに最初にリンクすることによって可能です、それはローカルIDをロケール特有フィードにマップします。

source: You can use this property to constrain the bounds of your content view inside the bounds of the safe area.
ja: あなたは、このプロパティを使うことで、あなたのコンテンツビューの境界を安全領域の境界内部に制約することができます。

source: You first hide everything as shown on line 1, and then add back only the symbol required at any point on the page.
ja: あなたは、まず行１で示されるようにすべてのものを隠して、それからページ上の任意の地点で必要とされるシンボルのみを再び加えます。

source: You need to use both a Mac running Xcode and an iPad to create a playground book.
ja: あなたは、Xcodeが動作するMacおよびiPadの両方がプレイグラウンドブックを作成するために必要です。

source: You store a subscription’s playgrounds (zipped .playgroundbook files) as well as its feed (a JSON file) and supporting resources on the web host.
ja: あなたは、サブスクリプションの持つプレイグラウンド（zipされた.playgroundbookファイル）だけでなくそれのフィード（JSONファイル）およびサポートリソースをウェブホスト上に格納します。

source: You use it to build up a feed for your subscription.
ja: あなたはそれを使って、あなたのサブスクリプションのためのフィードを作り上げます。

source: You use these fields to specify top-level details about the feed, as well as the details and metadata for each document in the feed.
ja: あなたは、これらのフィールドを使ってトップレベルの詳細をそのフィードについて指定します、それだけでなくそのフィードの中の各ドキュメントについての詳細とメタデータも。

source: You'll need to put your playgrounds online so learners can download the playground books that make up your subscription.
ja: あなたは、あなたのプレイグラウンドをオンラインに置く必要があります、それで学習者はあなたのサブスクリプションを作り上げるプレイグラウンドブックをダウンロードできます。

source: “Tap to write your code” is shown if no placeholder text is provided.
ja: プレースホルダーテキストが提供されないならば、「Tap to write your code」が表示されます。

source: Name
ja: 名前
